## Plan Result (1112: sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 7 to change, 8 to destroy.</code></pre>

* Create
  * local_file.config[&#34;00&#34;]
  * local_file.config[&#34;02&#34;]
* Update
  * azurerm_linux_function_app.example[&#34;02-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td&#34;]
* Replace
  * azurerm_key_vault_secret.client_id[&#34;00&#34;]
  * azurerm_key_vault_secret.client_id[&#34;02&#34;]
  * azurerm_key_vault_secret.client_secret[&#34;00&#34;]
  * azurerm_key_vault_secret.client_secret[&#34;02&#34;]
  * azurerm_key_vault_secret.tenant_id[&#34;00&#34;]
  * azurerm_key_vault_secret.tenant_id[&#34;02&#34;]
  * azurerm_key_vault_secret.tenant_url[&#34;00&#34;]
  * azurerm_key_vault_secret.tenant_url[&#34;02&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.client_id["00"] must be replaced
-/+ resource "azurerm_key_vault_secret" "client_id" {
      ~ id                      = "https://ingest00-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-CLIENT-ID/21c87f13a0dd4260bc9e61cca1ef0ccd" -> (known after apply)
      ~ name                    = "SERVICE-PRINCIPAL-CLIENT-ID" -> "SERVICE-PRINCIPLE-CLIENT-ID" # forces replacement
      ~ resource_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/secrets/SERVICE-PRINCIPAL-CLIENT-ID/versions/21c87f13a0dd4260bc9e61cca1ef0ccd" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/secrets/SERVICE-PRINCIPAL-CLIENT-ID" -> (known after apply)
        tags                    = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      - value                   = (sensitive value) -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "21c87f13a0dd4260bc9e61cca1ef0ccd" -> (known after apply)
      ~ versionless_id          = "https://ingest00-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-CLIENT-ID" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.client_id["02"] must be replaced
-/+ resource "azurerm_key_vault_secret" "client_id" {
      ~ id                      = "https://ingest02-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-CLIENT-ID/d9b68350b7f44c58ab6fc8e943e93622" -> (known after apply)
      ~ name                    = "SERVICE-PRINCIPAL-CLIENT-ID" -> "SERVICE-PRINCIPLE-CLIENT-ID" # forces replacement
      ~ resource_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox/secrets/SERVICE-PRINCIPAL-CLIENT-ID/versions/d9b68350b7f44c58ab6fc8e943e93622" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox/secrets/SERVICE-PRINCIPAL-CLIENT-ID" -> (known after apply)
        tags                    = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      - value                   = (sensitive value) -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "d9b68350b7f44c58ab6fc8e943e93622" -> (known after apply)
      ~ versionless_id          = "https://ingest02-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-CLIENT-ID" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.client_secret["00"] must be replaced
-/+ resource "azurerm_key_vault_secret" "client_secret" {
      ~ id                      = "https://ingest00-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-CLIENT-SECRET/94a7517158c14871854ceb4aa9b48b66" -> (known after apply)
      ~ name                    = "SERVICE-PRINCIPAL-CLIENT-SECRET" -> "SERVICE-PRINCIPLE-CLIENT-SECRET" # forces replacement
      ~ resource_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/secrets/SERVICE-PRINCIPAL-CLIENT-SECRET/versions/94a7517158c14871854ceb4aa9b48b66" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/secrets/SERVICE-PRINCIPAL-CLIENT-SECRET" -> (known after apply)
        tags                    = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      - value                   = (sensitive value) -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "94a7517158c14871854ceb4aa9b48b66" -> (known after apply)
      ~ versionless_id          = "https://ingest00-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-CLIENT-SECRET" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.client_secret["02"] must be replaced
-/+ resource "azurerm_key_vault_secret" "client_secret" {
      ~ id                      = "https://ingest02-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-CLIENT-SECRET/ab717e32a63642ac9e7df440d00d2d92" -> (known after apply)
      ~ name                    = "SERVICE-PRINCIPAL-CLIENT-SECRET" -> "SERVICE-PRINCIPLE-CLIENT-SECRET" # forces replacement
      ~ resource_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox/secrets/SERVICE-PRINCIPAL-CLIENT-SECRET/versions/ab717e32a63642ac9e7df440d00d2d92" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox/secrets/SERVICE-PRINCIPAL-CLIENT-SECRET" -> (known after apply)
        tags                    = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      - value                   = (sensitive value) -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "ab717e32a63642ac9e7df440d00d2d92" -> (known after apply)
      ~ versionless_id          = "https://ingest02-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-CLIENT-SECRET" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.tenant_id["00"] must be replaced
-/+ resource "azurerm_key_vault_secret" "tenant_id" {
      ~ id                      = "https://ingest00-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-TENANT-ID/fdae448b88c74f98b8d38066806e80d9" -> (known after apply)
      ~ name                    = "SERVICE-PRINCIPAL-TENANT-ID" -> "SERVICE-PRINCIPLE-TENANT-ID" # forces replacement
      ~ resource_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/secrets/SERVICE-PRINCIPAL-TENANT-ID/versions/fdae448b88c74f98b8d38066806e80d9" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/secrets/SERVICE-PRINCIPAL-TENANT-ID" -> (known after apply)
        tags                    = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      - value                   = (sensitive value) -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "fdae448b88c74f98b8d38066806e80d9" -> (known after apply)
      ~ versionless_id          = "https://ingest00-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-TENANT-ID" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.tenant_id["02"] must be replaced
-/+ resource "azurerm_key_vault_secret" "tenant_id" {
      ~ id                      = "https://ingest02-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-TENANT-ID/cfe0a257ccff4573b4f3a9ddcd058d5a" -> (known after apply)
      ~ name                    = "SERVICE-PRINCIPAL-TENANT-ID" -> "SERVICE-PRINCIPLE-TENANT-ID" # forces replacement
      ~ resource_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox/secrets/SERVICE-PRINCIPAL-TENANT-ID/versions/cfe0a257ccff4573b4f3a9ddcd058d5a" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox/secrets/SERVICE-PRINCIPAL-TENANT-ID" -> (known after apply)
        tags                    = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      - value                   = (sensitive value) -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "cfe0a257ccff4573b4f3a9ddcd058d5a" -> (known after apply)
      ~ versionless_id          = "https://ingest02-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-TENANT-ID" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.tenant_url["00"] must be replaced
-/+ resource "azurerm_key_vault_secret" "tenant_url" {
      ~ id                      = "https://ingest00-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-TENANT-URL/9972256ef6f34ccda7c8a48afc4ba40e" -> (known after apply)
      ~ name                    = "SERVICE-PRINCIPAL-TENANT-URL" -> "SERVICE-PRINCIPLE-TENANT-URL" # forces replacement
      ~ resource_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/secrets/SERVICE-PRINCIPAL-TENANT-URL/versions/9972256ef6f34ccda7c8a48afc4ba40e" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/secrets/SERVICE-PRINCIPAL-TENANT-URL" -> (known after apply)
        tags                    = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      - value_wo_version        = 0 -> null
      ~ version                 = "9972256ef6f34ccda7c8a48afc4ba40e" -> (known after apply)
      ~ versionless_id          = "https://ingest00-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-TENANT-URL" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.tenant_url["02"] must be replaced
-/+ resource "azurerm_key_vault_secret" "tenant_url" {
      ~ id                      = "https://ingest02-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-TENANT-URL/6897818c9eed4d33a4c34243823b049a" -> (known after apply)
      ~ name                    = "SERVICE-PRINCIPAL-TENANT-URL" -> "SERVICE-PRINCIPLE-TENANT-URL" # forces replacement
      ~ resource_id             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox/secrets/SERVICE-PRINCIPAL-TENANT-URL/versions/6897818c9eed4d33a4c34243823b049a" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox/secrets/SERVICE-PRINCIPAL-TENANT-URL" -> (known after apply)
        tags                    = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      - value_wo_version        = 0 -> null
      ~ version                 = "6897818c9eed4d33a4c34243823b049a" -> (known after apply)
      ~ versionless_id          = "https://ingest02-meta002-sbox.vault.azure.net/secrets/SERVICE-PRINCIPAL-TENANT-URL" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_linux_function_app.example["02-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-aplfpa-sbox02-uks-dlrm-01"
        name                                           = "af-aplfpa-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-aplfta-sbox02-uks-dlrm-01"
        name                                           = "af-aplfta-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox02-uks-dlrm-01"
        name                                           = "af-apluta-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-bails-sbox02-uks-dlrm-01"
        name                                           = "af-bails-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox02-uks-dlrm-01"
        name                                           = "af-joh-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox02-uks-dlrm-01"
        name                                           = "af-sbails-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-td-sbox02-uks-dlrm-01"
        name                                           = "af-td-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_00.json"
      + id                   = (known after apply)
    }

  # local_file.config["02"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "02"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_02.json"
      + id                   = (known after apply)
    }

Plan: 10 to add, 7 to change, 8 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":60,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->